_protected/controllers/PesertaController.php

    protected function findDokumen($id)
    {

        //$id = substr($id, 0, 6);
        $detailDokumen =  DokumenPendukung::find()->where(['peserta_id'=>$id,'tag_id'=>'5'])->one();
        //$detailDokumen->search(['DokumenpendukungSearch'=>['peserta_id'=>$id,'tag_id'=>'5']]);

        if (!empty($detailDokumen->uploaded_file_id))
        {
            return $foto = \app\models\UploadedFile::find()->where(['id'=>$detailDokumen->uploaded_file_id])->one();
---
SELECT * FROM `dokumen_pendukung` WHERE (`peserta_id`='520323.100') AND (`tag_id`='5')
SELECT * FROM `uploaded_file` WHERE `id`=2